{
  "act_dim": 6,
  "action_tanh": true,
  "activation_function": "relu",
  "architectures": [
    "DT"
  ],
  "attn_pdrop": 0.1,
  "bos_token_id": 50256,
  "drop_out": 0.1,
  "embd_pdrop": 0.1,
  "eos_token_id": 50256,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "max_ep_len": 1000,
  "model_type": "decision_transformer",
  "n_head": 1,
  "n_inner": null,
  "n_layer": 3,
  "n_positions": 1024,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "state_dim": 17,
  "torch_dtype": "float32",
  "train_data_mean": [
    -0.04489211615979194,
    0.03232611992451431,
    0.06034820791204714,
    -0.1708161758114941,
    -0.1947702336464969,
    -0.057516805782271266,
    0.09701419538351468,
    0.032391781978295245,
    11.047338665669947,
    -0.07997213109949118,
    -0.3236324481697188,
    0.3629688906533557,
    0.4232352315326554,
    0.4083653650984332,
    1.10850102882522,
    -0.48743752095133835,
    -0.07375080715086205
  ],
  "train_data_std": [
    0.04003537547801023,
    0.41147082308045785,
    0.542172066653844,
    0.4154345723272121,
    0.23797930126847824,
    0.6205318752047869,
    0.301056986310825,
    0.21742103892182604,
    2.2114263528640747,
    0.5726980024299755,
    1.7259377482375335,
    11.845534599872765,
    12.067534707608822,
    7.052667244859625,
    13.506407508532618,
    7.197610606290413,
    5.027524930529379
  ],
  "transformers_version": "4.28.1",
  "use_cache": true,
  "vocab_size": 1
}
